demo-load-login-test.yaml
config:
  target: "https://www.saucedemo.com/"
  processor: "./test-login-demo.js"
  
  plugins:
    apdex: {}
    ensure: {}

  apdex:
    threshold: 200 
    metrics:
      - "http.response_time"

  ensure:
    thresholds:
      - "http.response_time.p99 < 500"
      - "http.response_time.p95 < 250"
      - "apdex.score >= 0.90"
    conditions:
      - expression: "http.codes.200 == http.requests" 

  engines:
    playwright:
      launchOptions:
        headless: true

  phases:
    - duration: 30
      arrivalRate: 2
      name: "Normal Mode"
    - duration: 60
      arrivalRate: 3
      rampTo: 15
      name: "Beban Test"

scenarios:
  - engine: playwright
    testFunction: "scenario"