demo-load-login-test.yaml
config:
  target: "https://www.saucedemo.com/"
  processor: "./test-login-demo.js"
  
  payload:
    path: "user-login.csv"
    fields:
      - "username"
      - "password"
    order: "sequence"

  engines:
    playwright:
      launchOptions:
        headless: true

  ensure:
    thresholds:
      - "browser.page.FCP.https://www.saucedemo.com/ < 5000"
    conditions:
      - expression: "(vusers.failed / vusers.created) * 100 < 5"

  phases:
    - duration: 30
      arrivalRate: 2
      name: "Warm up (Sabar Mode)"
    - duration: 60
      arrivalRate: 3
      name: "High Traffic (Stress Test)"

scenarios:
  - engine: playwright
    testFunction: "scenario"