load-test.yaml
config:
  target: "https://alibnymn.github.io"
  processor: "./test-porto.js"
  
  engines:
    playwright:
      launchOptions:
        headless: true
      contextOptions:
        viewport: { width: 1280, height: 720 }
        ignoreHTTPSErrors: true

  phases:
    - duration: 50
      arrivalRate: 3
      rampTo: 2
      name: "Warm up"
    - duration: 60
      arrivalRate: 4
      name: "Sustained Load"

  plugins:
    ensure: {}
    # --- KONFIGURASI APDEX ---
    apdex:
      threshold: 1500 # Target kecepatan dalam milidetik (ms)
      attribute: "browser.page.FCP.https://alibnymn.github.io/" # Metrik yang diukur
    metrics-by-endpoint: {} # Menampilkan error detail per API/Endpoint

  ensure:
    thresholds:
      - "browser.page.FCP.https://alibnymn.github.io/ < 3000"
    conditions:
      - expression: "(vusers.failed / vusers.created) * 100 < 5"

scenarios:
  - engine: playwright
    testFunction: "scenario"